Autodesk.Navisworks.Api.Viewpoint
Represents a viewpoint

Autodesk.Navisworks.Api.Viewpoint.#ctor
Default constructor
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.Viewpoint.AlignDirection(Autodesk.Navisworks.Api.Vector3D)
Rotate camera so that it points in given direction using shortest
rotation path.

Autodesk.Navisworks.Api.Viewpoint.AlignUp(Autodesk.Navisworks.Api.Vector3D)
Rotate camera about view direction so that camera up vector is
aligned with given up vector (in same plane as view direction and
given up vector).

Autodesk.Navisworks.Api.Viewpoint.AngularSpeed
Angular speed of the camera.
Throws System.NotSupportedException:
AngularSpeed not set

Autodesk.Navisworks.Api.Viewpoint.ApertureDiameter
The diameter of the physical camera aperture in camera units. Used for advanced rendering effects.

Autodesk.Navisworks.Api.Viewpoint.AspectRatio
Aspect ratio of camera (width/height).  Default 1.0 (square).

Autodesk.Navisworks.Api.Viewpoint.ClipPlanes
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 's' is null
Throws System.ArgumentException:
Argument 's' has been Disposed

Autodesk.Navisworks.Api.Viewpoint.CreateCopy
Creates a copy of the Viewpoint.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Viewpoint.FarDistance
Distance from eye point to far plane along view direction. Must be greater than near distance.

Autodesk.Navisworks.Api.Viewpoint.FarDistanceType
Describes the users intentions if the product has to modify the far distance (typically because of graphics system limitations).

Autodesk.Navisworks.Api.Viewpoint.FarPlaneDistance
Far plane distance.

Autodesk.Navisworks.Api.Viewpoint.FocalDistance
The focal distance of the camera.
Throws System.NotSupportedException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.GetCamera
Describes viewpoint in terms of an JSON AutodeskCommonCamera object.

Autodesk.Navisworks.Api.Viewpoint.HasAngularSpeed
Determines if AngularSpeed has been set

Autodesk.Navisworks.Api.Viewpoint.HasFocalDistance
Determines if FocalDistance has been set

Autodesk.Navisworks.Api.Viewpoint.HasLighting
Determines if Lighting has been set

Autodesk.Navisworks.Api.Viewpoint.HasLinearSpeed
Determines if LinearSpeed has been set

Autodesk.Navisworks.Api.Viewpoint.HasRenderStyle
Determines if RenderStyle has been set

Autodesk.Navisworks.Api.Viewpoint.HasTool
Determines if Tool has been set

Autodesk.Navisworks.Api.Viewpoint.HasViewer
Determines if Viewer has been set.

Autodesk.Navisworks.Api.Viewpoint.HasWorldUpVector
Determines if WorldUpVector has been set

Autodesk.Navisworks.Api.Viewpoint.HeightField
Defines camera field of view in combination with aspect ratio.
For a perspective camera, this is the vertical field of view
(the angle between top and bottom planes of the camera view frustum).
For an orthographic camera, this is the distance between top and
bottom planes of the camera view frustum.
Default 0.785398 (45 degrees)

Autodesk.Navisworks.Api.Viewpoint.HorizontalExtentAtFocalDistance
The distance between the left and right planes of the view frustum at
the focal distance along the view direction from the camera position.
Throws System.InvalidOperationException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.HorizontalScale
Required horizontal scaling of the image when adapting the camera view to the display window.

Autodesk.Navisworks.Api.Viewpoint.ImageFit
Describes how to adapt the camera view so that it's aspect ratio matches that of the display window.

Autodesk.Navisworks.Api.Viewpoint.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Viewpoint.Lighting
Lighting used for this viewpoint
Throws System.NotSupportedException:
Lighting not set

Autodesk.Navisworks.Api.Viewpoint.LinearSpeed
Linear speed of the camera.
Throws System.NotSupportedException:
LinearSpeed not set

Autodesk.Navisworks.Api.Viewpoint.NearDistance
Distance from eye point to near plane along view direction. Must be greater than zero.

Autodesk.Navisworks.Api.Viewpoint.NearDistanceType
Describes the users intentions if the product has to modify the near distance (typically because of graphics system limitations).

Autodesk.Navisworks.Api.Viewpoint.NearPlaneDistance
Near plane distance.

Autodesk.Navisworks.Api.Viewpoint.PointAt(Autodesk.Navisworks.Api.Point3D)
Rotate camera so that it points at given location using shortest
rotation path.

Autodesk.Navisworks.Api.Viewpoint.Position
Position of the camera.

Autodesk.Navisworks.Api.Viewpoint.Projection
The projection type of the current viewpoint.

Autodesk.Navisworks.Api.Viewpoint.RenderStyle
The style used for rendering.
Throws System.NotSupportedException:
RenderStyle not set

Autodesk.Navisworks.Api.Viewpoint.RightOffsetAtFocalDistance
Distance that the plane normal to the view direction, at the focal distance
along the view direction from the camera position, is offset to the right.
Need to call SetFocalDistance before using this property.
Throws System.InvalidOperationException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.RightOffsetFactor
The ratio between the right offset (the distance that the target plane is offset to the right) and the
horizontal extent (the distance between the left and right planes of the view frustum at the target distance).

Autodesk.Navisworks.Api.Viewpoint.Rotation
Rotation of camera from base orientation. The base
orientation is looking down the negative Z-axis with
+X to the right and +Y up.
Default 0 0 0 1 (no rotation).

Autodesk.Navisworks.Api.Viewpoint.SetCamera(System.String)
Set viewpoint from JSON AutodeskCommonCamera.
cameraJson: Camera in the form of a JSON AutodeskCommonCamera object.
Throws System.ArgumentException:
Failed to set camera.

Autodesk.Navisworks.Api.Viewpoint.SetExtentsAtFocalDistance(System.Double,System.Double)
Set the distances between the left and right planes, and the top and bottom planes of the
view frustum at the focal distance along the view direction from the camera position.
Need to call SetFocalDistance before calling this method.
Throws System.InvalidOperationException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.ShutterSpeed
The time measured in seconds that the physical aperture is open. Used for advanced rendering effects.

Autodesk.Navisworks.Api.Viewpoint.Tool
The Tool in use.
Throws System.NotSupportedException:
Tool not set

Autodesk.Navisworks.Api.Viewpoint.TrySetCamera(System.String)
Try to set viewpoint from JSON AutodeskCommonCamera.
cameraJson: Camera in the form of a JSON AutodeskCommonCamera.
Returns: false if operation fails

Autodesk.Navisworks.Api.Viewpoint.UpOffsetAtFocalDistance
Distance that the plane normal to the view direction, at the focal distance
along the view direction from the camera position, is offset upwards.
Need to call SetFocalDistance before using this property.
Throws System.InvalidOperationException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.UpOffsetFactor
The ratio between the up offset (the distance that the target plane is offset upwards) and the
vertical extent (the distance between the top and bottom planes of the view frustum at the target distance).

Autodesk.Navisworks.Api.Viewpoint.VerticalExtentAtFocalDistance
The distance between the top and bottom planes of the view frustum
at the focal distance along the view direction from the camera position.
Throws System.InvalidOperationException:
FocalDistance not set

Autodesk.Navisworks.Api.Viewpoint.ViewerAvatar
Avatar used for this viewpoint.
Throws System.NotSupportedException:
Viewpoint not set.

Autodesk.Navisworks.Api.Viewpoint.ViewerCameraMode
Avatar used for this viewpoint.
Throws System.NotSupportedException:
Viewpoint not set.

Autodesk.Navisworks.Api.Viewpoint.WorldUpVector
Preferred up vector. Used by "walk" paradigm navigation methods to move on a plane.
Throws System.NotSupportedException:
WorldUpVector not set

Autodesk.Navisworks.Api.Viewpoint.ZoomBox(Autodesk.Navisworks.Api.BoundingBox3D)
Zooms the viewpoint to view a given bounding box.
box:
The bounding box to zoom to view.